[{"content":"I did not expect 2021 to be a whole second year of Covid. When I chose my yearly theme, the Vaccine had been completed and it looked like full vaccinations would happen by the end of Spring. How could I have foreseen Covid being so political that almost a year after after the vaccine started being given, we would be at 61% of the country vaccinated, and have experienced two variants and three whole waves requiring the wold to continue shutting down.\nBut this isn\u0026rsquo;t a retrospective on a year of Covid, it\u0026rsquo;s a retrospective on my year. When I started this year, I told myself I would make it my Year of Discovery. I spent too much of 2020 stagnating. I knew there was a chance for Covid to not disappear and my Year of Discovery was not predicated on Covid disappearing. I am generally happy with how I did and I\u0026rsquo;m glad at the clarity that Year of Discovery provided me. I even reconnected with some friends in a way that has done nothing but made my life better.\nMusic Music is probably the place I progressed the least. I did play guitar and bass more than I did in 2020, but that wasn\u0026rsquo;t by much. However, I will take any progress I can. I started a pedal collection and started playing around with creating soundscapes and I discovered a new love for the creation of music. I have set myself up to create more music as time goes on and I have slowly started repairing my relationship with music. My band situation is uh complicated but I have faith things will work out.\nExploration I have taken 2021 to explore so much of what I wanted. I didn\u0026rsquo;t do nearly as much as I wanted to, but that\u0026rsquo;s life isn\u0026rsquo;t it. I picked up an annual pass for both the Natural History Museum and Universal Studios. I know they\u0026rsquo;re not remotely similar but both show me expanding. I did get my Amateur Radio License. I\u0026rsquo;ve done other small things over the year (gotten an Xbox and played more games, went out to different places, went to concerts again) but all of them kinda show the same thing. Me exploring and growing. The wildest discovery is that I\u0026rsquo;m slowly becoming a car girl. Pls send help lol. No but seriously I got super into F1, and then Forza, and now I wanna get a beater car and do Rallycross. Send help.\nRelationships This is probably the most surprising thing to come from this year. I started this year with a messy breakup and a lot of introspection needed onto what I wanted and needed in a relationship. I fully expected 2021 to be a year I spent single and used that to grow. I guess mid year me had other plans because I am now in a relationship with a wonderful person. But more than that, this person has taught me so much of what a good relationship should look like. How communication should work. How to approach difficult situations. What I deserve in a relationship and what I should give. And I think the most important thing is I\u0026rsquo;ve discovered how to keep being my own person and have my own time separate from the relationship. And that is something I had struggled tremendously on. And that is something I am incredibly grateful for.\nGender Okay. This is a hard section to write. Not necessarily because I am still confused (tho I still am). More because I will be putting something out to the internet. This year I approached something that I had had in my periphery for a while but, I don\u0026rsquo;t know if I was just too scared or not ready for the answer. But after this year, there\u0026rsquo;s no way to deny it. I am Trans. What exactly that means I am not sure. I currently feel comfortable calling myself non-binary but I am still going through a lot of emotions. I just know that I am not cis. It helps clear up so much of why I have felt how I have for the last 26 years of my life. I think the hardest part of this year is not that I discovered that I\u0026rsquo;m trans. It\u0026rsquo;s that this is just the start of a journey that will take years. A journey that will never end. But I am looking forward to it, because it is a journey that will lead to a peace of mind that I have so desperately been looking for.\nWrap-Up So where does this leave me. Oddly, both with a sense of accomplishment, but also a feeling that my journey has just started. Which, at 27 years old, is a feeling I\u0026rsquo;m starting to get tired of. I\u0026rsquo;ve discovered things about myself, and also discovered new paths for me to go down. Some of them will be dead ends, but some will lead me to becoming the best version of me that I can be. And overall, I\u0026rsquo;m happy at that. I genuinely believe this to be my most successful theme. And I hope I can keep this energy and momentum into 2022. Because I need it.\n The concept of yearly themes comes from the podcast Cortex with CGP Grey and Myke Hurley. They have genuinely helped me think of my life in a way better way. You can also check them out a video that Grey made about yearly themes here https://www.youtube.com/watch?v=NVGuFdX5guE\n","date":"2021-12-29T00:00:00Z","permalink":"https://zaza.studio/p/2021-retrospective/","title":"Yearly Theme Wrap-up 2021: Year of Discovery"},{"content":" This was first written in May 2021 but due to a mental block I didn't get it uploaded until September 2021  Music has been a massive part of my life for about as long as I remember. Just now, a friend was asking her friends about their favorite songs. That sent me down a spiral about what my favorite music is. Before, I held the position that it was impossible for me to hold a \u0026ldquo;favorite song\u0026rdquo; but now, that\u0026rsquo;s changed. I came up with a short list of songs that truly impacted me and honestly made me who I am today. That may sound melodramatic, but I genuinely can\u0026rsquo;t think of any other way to put how these songs impacted me.\nThe songs are in no particular order. Its literally the order I came up with them at 10:30 on a Monday in May.\nParabol/Parabola - Tool This would probably be the first song I can for sure say is my \u0026ldquo;favorite\u0026rdquo;. It was one of my first experiences with a song that lasted longer than the traditional 2:30 - 4:00 minute song. It\u0026rsquo;s a 9 minute song that has one of the greatest dynamic shifts I have ever heard in music.\nThe lyrics going into the concept of a body and spirit, the illusion of pain in life, and the idea of an eternal soul, and rebirth were all new to me when I first heard this song, and that whole thing combined has me coming back to this song over a decade later.\nVoice of Trespass - Between the Buried and Me This is probably the only \u0026ldquo;fun\u0026rdquo; song on this list, in that it\u0026rsquo;s not a song that is extremely emotionally charged for me. This song is just a masterful experiment with fucking heavy jazz metal. The song starts with a swing beat, but done on double bass instead of a ride cymbal, and a horn section swelling while distorted guitars chug. From there, its 8 minutes of absolute masterful playing.\nI don\u0026rsquo;t know what else I can add other than if you have not heard this song, you need to. It played with the concept of genres in a wild way and opened me up to the idea that genres are not rigid and can be whatever we make them to be.\nThe Grid - Between the Buried and Me The Grid is the song that comes right after Voice of Trespass, but the reason I love The Grid is far different from why I love Voice. It is another epic Prog Metal song (I sense a trend), this one almost 10 minutes long. But what Voice had in, this one has in sheer grandeur. The entire song is a journey and a soundscape like no other.\nBut the thing that pushes it over the edge is about six minutes in. An acoustic guitar comes in, and the vocalist just starts repeating the phrase \u0026ldquo;We are in this together.\u0026rdquo; The music keeps growing and more voices are added as that phrase keeps being repeated, a crescendo of sound happens before it all crashes down into one of the most beautiful guitar solos I\u0026rsquo;ve ever heard. This isn\u0026rsquo;t like a shredfest, it is something where you can sense the emotion, the melancholy, the energy that went into the album in every single note.\nJaguar God - Mastodon Another long prog song. This one clocking in at 8 minutes. Jaguar God is an amazing ode to storytelling and metaphor. The song, and the album as a whole, was written about cancer and how it eventually destroys a person. The song itself I interpret as the person\u0026rsquo;s journey from diagnosis to death, in the metaphor of someone being sacrificed to the Aztec god Tezcatlipoca.\nI could go on about this song, it\u0026rsquo;s probably the song I have spent the most time analyzing. I can talk about how the arpeggiated acoustic motif and 6/8 time signature represent the protagonist, how the fast 4/4 distorted guitars represent death, and the sections where there is 4/4 and 6/8 polymeter is our protagonist confronting death itself. But the part of this song that gets me is the end, when after going through the journey and essentially losing every element of the song that was present, it immediately returns to the 6/8 arpeggiated motif of the intro. Except, on this reprise, there are no lyrics. There is only a guitar solo, a sound that I hear as a person\u0026rsquo;s last cry before death finally takes them away.\nI have lost multiple family members to degenerative diseases. So to hear that journey made real in a song is an impact that I can never overstate.\nI Appear Missing - Queens of the Stone Age Okay. 6 minutes, better, thats almost a normal song length. I Appear Missing came out at such a pivotal point in my life. It was when I was graduating high school and going to college. The songs is just beautiful, but the theme of feeling like you have lost a part of yourself is just so powerful. At many points in this time period, and in my life as a while, I have felt like I was a stranger staring into the life of someone else. That feeling of being forgotten, discarded, useless, its just so powerful and such a recurring theme in my life.\nLike a Stone - Audioslave I can\u0026rsquo;t do this song justice. There\u0026rsquo;s been so much written and talked about it already. If you want to know what makes this song the masterpiece it is, I cannot recommend 12Tone\u0026rsquo;s Video enough.\nFor me, Like a Stone is a constant reminder of the journey I\u0026rsquo;m on. I have spent many nights awake, thinking about my death, about what I have accomplished in life, what I will never accomplish, about the afterlife, and just spent some time in really dark places. The song itself has a kind of sparse feeling, there is plenty of space left\nI honestly can\u0026rsquo;t say anything about this song that Chris Cornell didn\u0026rsquo;t already put masterfully into the lyrics of the song itself. Chris Cornell\u0026rsquo;s death impacted me greatly and I cannot think of this song without thinking of him, and vise versa.\neverything i wanted - Billie Eilish This song is really out of left field sonically for this list, but I think that\u0026rsquo;s what makes it stand out even more. The relaxed synth tone is phenomenal in this song, it has a strong melancholy, heavy feel without being loud or overly in your face. Billie explores the concept of fame through the framing of suicide, and how looking back, would she have made the same decisions knowing the outcome. How if \u0026ldquo;getting everything you wanted\u0026rdquo; might actually be a nightmare.\nCough Syrup - Young the Giant Beautiful song, the dynamic shifts really make the song. The song is a sort of desperate hopelessness at not being at the point where you want to be in life. The want to escape to some temporary happiness to compensate for the happiness that has been denied from you.\nPeace to the Mountain - Coheed and Cambria There are so many Coheed songs I could pick, so why this one. Seeing the rest of my list, a song like Gravity\u0026rsquo;s Union or Welcome Home seems more appropriate. But again, this song showed up in such a key point in my life. I have always felt the desperate need to escape. To run away. To travel and go somewhere new, away from everything and everyone I know, leaving all my problems behind. The tone of the song itself feeds into this. Throughout the song there is this feeling of longing. Like the melody keeps trying to keep going somewhere but just can\u0026rsquo;t.\n That\u0026rsquo;s it. This was a deeply personal list and I realize that I wrote more about the lyrics than the musical content of each song. But I\u0026rsquo;m just not well versed (heh) enough to be able to talk about how a song\u0026rsquo;s choice in key or chords or the way that a song is sang can contribute to the overall feel of the song. I tried to include it where I felt I could verbalize it.\nAlso this is my personal list. This is nowhere near the \u0026ldquo;greatest songs ever\u0026rdquo; list. This is a deeply deeply personal list of my favorite songs, and why they are a part of me.\n Emma Medina\nEmma Medina is a musician, gamer, and Magic player from Southern California.\n","date":"2021-09-14T00:00:00Z","permalink":"https://zaza.studio/p/top-songs/","title":"My Favorite Songs and the Impact Music has had on My Life"},{"content":"So, 2020 sucked. I have been doing yearly themes since I believe 2015 and 2020 is the only year where I completely lost track of my theme. I don\u0026rsquo;t think I need to go into why covid but it\u0026rsquo;s time to get back on the train.\nSo for 2021, I am doing a 180 from the life I led in 2020. Last year might as well have been \u0026ldquo;the Year of Lockdown\u0026rdquo;. So to get back out there and open my horizons, I am making 2021 my \u0026ldquo;Year of Discovery\u0026rdquo;.\nWhat do I mean by Discovery. There\u0026rsquo;s so much to this world that you can\u0026rsquo;t experience inside the same 4 walls. And there\u0026rsquo;s so much you can do inside those 4 walls that isn\u0026rsquo;t just binging Netflix and doomscrolling Twitter. So I am going to focus on expanding my horizons and taking advantage of what the world has to offer.\nIn the start of the year, this is gonna be a re-focus on my hobbies. I\u0026rsquo;ve set up my guitar and bass rig for the first time since Covid shut my band down. I\u0026rsquo;m exploring new ways to play either instrument that I hadn\u0026rsquo;t done before. On guitar, I\u0026rsquo;m learning how to play math rock style tapping guitar. And on bass, my band is going down to A so I\u0026rsquo;m learning how to play in A standard. Both are providing me with a new challenge and allowing me to explore a new way of playing music that I never have before.\nI\u0026rsquo;m also getting my amateur radio license. Learning Ham radio is something I have been wanting to do since High School and I realized if I keep pushing it off I\u0026rsquo;ll never get it done. So I picked up a Baofeng radio and have a test scheduled soon to get my Ham license.\nBesides that, I\u0026rsquo;m just not letting the pandemic keep me locked up anymore. I\u0026rsquo;ve started going out hiking. I\u0026rsquo;m planning on meeting up with my band soon to actually play music.\nAll in all, I miss life. And my yearly theme is just a way for me to start living again.\n The concept of yearly themes comes from the podcast Cortex with CGP Grey and Myke Hurley. You can also check them out a video that Grey made about yearly themes here\n","date":"2021-02-06T00:00:00Z","permalink":"https://zaza.studio/p/yearly-theme-2021/","title":"Yearly Theme 2021: Year of Discovery"},{"content":"Photography is an expensive hobby. It\u0026rsquo;s one I love but definitely will suck as much money as you put into it. So when I see a lens that costs $35 on Amazon, I know I need to get it immediately.\n Fotasy Lens  Taken with iPhone 11\nFotasy 35mm f/1.6 Micro 4/3 Lens The lens I picked up is the Fotasy 35mm f/1.6 lens. It\u0026rsquo;s Micro 4/3 lens so it\u0026rsquo;s a 70mm equivalent. That\u0026rsquo;s a bit tight for pure street photography but I should be able to make it work. And it should be great for portraits. \u0026ldquo;Should\u0026rdquo;. More on that in a bit.\nThe lens itself feels solid. It is made of metal, which I definitely didn\u0026rsquo;t expect for a lens that cost $35. The lens felt pretty damn sharp on my camera\u0026rsquo;s screen, but when I reviewed the images I got a different story. It\u0026rsquo;s definitely a lot sharper than you\u0026rsquo;d expect out of a $35 lens. It\u0026rsquo;s not a Holga, but it is a far cry from more expensive lenses. I was expecting something like a toy camera lens but this is almost useable.\n BOKEH  This lens does have some killer Bokeh\nThe interesting thing about the lens is that the aperture is stepless. There\u0026rsquo;s no clicks at any f-stop,m. There\u0026rsquo;s definitely a freedom to this. If I want to open the aperture slightly more than f/8 without going all the way to f/5.6, I easily can. It makes you think a lot more about your shots. I believe this kind of aperture is more common on video lenses. However, the softness of the lens doesn\u0026rsquo;t seem to lend itself to video.\nThere are trade-offs of course. The lens is fully manual. There\u0026rsquo;s no electronics in it whatsoever. There is no autofocus. If you\u0026rsquo;re trying to shoot sports, animals, or children this is not the lens for you. But if you\u0026rsquo;re able to take a second to frame and focus your shot this lens might be what you\u0026rsquo;re looking for.\n Bike  It took me a while to get used to a 70mm equivalent lens. Can you tell I normally shoot wide?\nHowever, it is still a $35 lens. Mine came with what could be a design choice or a defect. Most likely defect. The focus ring turns about an 1/8 of a turn past infinity. So if you\u0026rsquo;re shooting from the hip that might lead to lost shots. I cannot trust this lens to zone focus. I don\u0026rsquo;t know if this is an issue with my lens specifically or with this lens in general but it is something to talk about. There\u0026rsquo;s also slight resistance and grating in the focus ring around infinity. Not major, but something you feel.\nImage Quality and Experience I ended up rewriting this whole section once I viewed my images on my computer. On my cameras tiny screen, the pictures looked sharp and in focus and I thought I was getting great shots.\nThe image quality on this lens is not great. It has a very soft feel, even when focused at f/16. The image quality reminds me of a mediocre film point and shoot. And that I might not be a bad thing if that\u0026rsquo;s what you\u0026rsquo;re looking for. The lens has some pretty bad vignetting, and in some images it actually ruins the shot. I could see taking shots with this, running it through some VSCO filters and getting a really nice film feel. But this should not be your main lens.\n Missed Shot  I focused to infinity for this shot. But since the lens is defective and goes past infinity, the shot was missed. This isn\u0026rsquo;t the only shot I missed, and I\u0026rsquo;m not proud of it, but something anyone considering this lens should think about.\nWhat I did like about this lens is how tiny it is. Like, it\u0026rsquo;s small. It\u0026rsquo;s not quite a pancake lens but it\u0026rsquo;s almost there. It\u0026rsquo;s about 3/4 the size of the kit lens when the kit lens is closed, and less than 1/2 the size of the fully extended kit lens. And for me, that\u0026rsquo;s a completely new experience. The majority of my experience with cameras comes from a Nikon d3300 and its lenses. And I can\u0026rsquo;t help but think of the tele on that and comparing it to this tiny thing.\nAs for the focal length, I am shooting on Micro 4/3, which means this 35mm lens acts more like a 70mm. This is a change for me because I normally like shooting a lot wider. My last post was literally gushing over the iPhone 11\u0026rsquo;s 13mm equivalent lens. So it was a full 180 for me. But it gives me another perspective.\n Portrait  Probably my favorite shot with this lens. However, this lens is too soft to take real portraits with.\nThe lens ends up acting a bit like a portrait lens on my camera. And that kind of makes the softness of the lens hurt a bit more. 70mm is such a good portrait lens and the way subjects look is honestly incredible, but I won\u0026rsquo;t really be able to use it for that if my subjects won\u0026rsquo;t come out sharp.\nUsing a 10 Year Old Mirrorless So this has been the most surprising part of the whole experience to be quite honest. I\u0026rsquo;m using an Olympus PEN E-PL1. This is a camera that came out 10 years ago in 2010. In the world of digital, to use even a year old camera isn\u0026rsquo;t seen well, let alone a camera from the previous decade.\nBut it\u0026rsquo;s been great. The camera accepted the lens immediately and I was able to shoot right after mounting it. This was actually a big concern for me since I saw so many reviews about needing to dig through settings to allow cameras to accept a fully manual lens. But no, it worked right away.\n Pipes  My camera metered the light perfectly every time. I just wish this lens didn\u0026rsquo;t suck. You don\u0026rsquo;t see sharpness at any point of this shot.\nOf course autofocus and camera controlled aperture don\u0026rsquo;t work. It is a manual lens. But with the camera on P, it does a pretty phenomenal job of metering the light and choosing the right ISO and shutter speed for the shot. In terms of light metering, I haven\u0026rsquo;t had a miss.\nThere are definitely features I wish I had. The E-PL1 has no focus peaking. So focus has to either be intuition or zooming in with the screen on the back. And I\u0026rsquo;ve definitely missed shots like that. But that\u0026rsquo;s part of the fun of a manual lens. If I wanted shots to be perfectly focused every time I\u0026rsquo;d just use my kit lens at f16.\nAnd of course a 12MP 10 year old sensor isn\u0026rsquo;t exactly cutting edge right now. The ISO is useable only down to about 800. ISO 1600 is pushing it and ISO 3200 is a noisy mess. This is especially challenging to work with on a lens that\u0026rsquo;s already pretty soft.\nConclusion I hadn\u0026rsquo;t been able to put this lens down. And I think that\u0026rsquo;s the most important thing. Since I got this lens it\u0026rsquo;s just lived on my camera. It\u0026rsquo;s fun, it\u0026rsquo;s interesting, it\u0026rsquo;s kinda odd and unique and finicky and sometimes bad. Often bad. It\u0026rsquo;s imperfect. In my first draft of this article I praised that imperfection. After seeing my shots I think that praise was a bit early.\n Kiah  I had to include a picture of dog.\nBut I wanted a lens that helped me shoot more. I could have saved for months and spent $1000 on a wonderful prime. But $35 and two days of shipping and I\u0026rsquo;m shooting now.\nBut, buy a $35 lens, expect $35 lens quality.\n","date":"2020-10-05T00:00:00Z","permalink":"https://zaza.studio/p/darkroom-diary-35-dollar-lens/","title":"Darkroom Diary: Using a $35 Lens on a 10 Year Old Camera"},{"content":"I was very into photography a few years ago. Decent DSLR, lenses, accessories, the whole deal. But for various reasons my love of photography left me. The camera was too heavy to bring, I wasn\u0026rsquo;t good enough, and I had some personal reasons. So I kinda stopped photography. The DSLR was sold off. My film camera is in a box somewhere. It all just\u0026hellip; stopped.\nThat changed when I got my iPhone 11.\n Ranch Fire  Ranch Fire in Socal 2020\nSwapping to this phone, it genuinely feels like I can just pull my phone out and get the shot I want. My phone feels like a standalone camera while in the camera app. AND I HAVE A WIDE ANGLE LENS. Sure your 300mm lens is cool, a nifty 50mm is a delight to shoot with, but give me something under 24mm any day. And the wide angle is a 13mm equivalent. Yes. Please.\nLemme go over the specs real quick before I get into why I\u0026rsquo;m going back to shooting.\nCamera Specs  iPhone Camera  Taken with iPhone 10\nThe iPhone 11 has two cameras in it. The 11 Pro has three. The regular camera is a 12MP 26mm equivalent, the wide angle is a 13mm equivalent, and the telephoto in the Pro is a 52mm equivalent. All with built in optical stabilization.\nBut specs are just specs. My DSLR from a few years ago had a higher pixel count, better autofocus, and was APS-C so I didn\u0026rsquo;t have to rely on software tricks to get things like Bokeh or shallow depth of field. It was a better camera spec wise. But there\u0026rsquo;s a reason I\u0026rsquo;m taking more pictures with my phone now than I did with my DSLR back then.\nShoot with the Camera you Have  Chain Link Fence \nThis is the first advice you will receive as a photographer. The best camera in the world is the one you have with you. It doesn\u0026rsquo;t matter if you own multi-thousand dollar cameras and lenses, if your camera is stuck at home and you miss shots, that gear might as well not exist. This obviously is a particularly strong pro to the iPhone, since basically no one leaves their home without their phone anymore. And this isn\u0026rsquo;t just a plus for the iPhone, almost any phone camera is able to take phenomenal photos\nBut beyond that, the iPhone 11 allowing me to have essentially two different lenses to get different shots allows me to take pictures I otherwise wouldn\u0026rsquo;t. There\u0026rsquo;s no need to think \u0026ldquo;do I need to bring my 12mm and my 35mm\u0026rdquo; if I have both right in my pocket. And in general, no matter where I go I don\u0026rsquo;t need to feel bad about leaving my big camera at home if I have something in my pocket for almost any situation.\nDoes it Bring Joy The thing is, most of that last section could apply to my iPhone 7. Why didn\u0026rsquo;t I shoot on my 7 and why did my 11 get me to shoot.\n Chilling \nIt goes back to another topic that comes up time and again with cameras. Is it a joy to shoot? The reason people shoot film, or spend thousands on lenses, or buy point and shoots when their big cameras would shoot better, is because they like shooting with that gear. If you enjoy taking pictures, you\u0026rsquo;ll take more picture.\nThe iPhone 7 was not a joy to shoot on. At one point is was a great camera. But that phone is now 4 years old. The processor is showing its age and it wasn\u0026rsquo;t seamless to take pictures. The screen wasn\u0026rsquo;t anything to write home about. There were some shots that came out great, but the limitations of the camera made it so I felt like I missed more shots than I took. Tracking pictures felt like a chore.\nBut now I got the iPhone 11. And it\u0026rsquo;s a hell of a difference. The camera is a joy to shoot. Having the extra wide angle lens opens so many shots up to me. And I feel like I\u0026rsquo;m working with the strengths of the camera, not against its limitations.\n Construction \nPart of the joy of taking pictures for me is the edit process, believe it or not. Going through photos, finding the great shots in between all the trash, and making them shine just fills me so much. But on the iPhone 7, the screen was small enough and my eyes bad enough that I never wanted to edit on there. And by the time I was on my desktop or laptop, the photos never made their way into Lightroom and never got done.\nTwo things have changed that for me. One being the new nicer screen. The other being finding Darkroom, a phenomenal Lightroom alternative that works with iCloud. It\u0026rsquo;s nice to be able to walk around, take pictures, and edit the pictures while stopping for coffee. The immediacy of taking a picture, and being able to edit it on phone to show its true potential is so huge for me.\nA Strange Turn in Life Of course, gear isn\u0026rsquo;t the only thing that matters. I could have gotten any piece of camera gear that could have revived my love for photos right now. And if I would have gotten this phone six months ago, I doubt I\u0026rsquo;d have gotten back into photography. So what changed?\nI don\u0026rsquo;t know. A lot and nothing at all? It\u0026rsquo;s hard to say.\n Empty Road \nI mean, it\u0026rsquo;s hard to talk about anything happening in 2020 without talking about the pandemic. I loved going out and discovering new things. Odds are if you\u0026rsquo;re reading this and know me you know I have a band. My band was playing gigs essentially monthly. I had a full life and was starting to be happy. Then pandemic. And after 6+ months locked up, I\u0026rsquo;ve gotten to appreciating my experiences, and now have a deep need to document it all because I now know how fragile the whole thing really was.\nOn top of that, I played \u0026ldquo;Life is Strange\u0026rdquo; and it brought me back to when I considered myself a photographer, when I most cared. It was my freshmen year of college, I was in dorms alone for the first time in my life and I didn\u0026rsquo;t have a direction that I was certain in. And I remembered that feeling of looking through a viewfinder and in a way finding myself every time, how that helped me then. And how I really need that help now.\n Kiah \nAnd I have a supportive partner. The most supportive partner when it comes to hobbies. And that opened my eyes to why I quit before. When I was last taking pictures, I honestly had no one to share the hobby with. I had one person who also liked photography, but they ended up believing their way of shooting was the \u0026ldquo;right\u0026rdquo; way and would belittle my photos to the point where I genuinely started having anxiety using my camera around them. But this person is in the past, and I\u0026rsquo;m working to make sure they don\u0026rsquo;t affect me.\nAnd honestly, having someone believe in what you\u0026rsquo;re doing matters a lot. Being an artist can get lonely. It\u0026rsquo;s hard to talk about your hobbies when people don\u0026rsquo;t see things the way you do. Everyone has a phone in their pockets with a good camera. But most people don\u0026rsquo;t think of their shots past putting the subject in the middle of the frame. People aren\u0026rsquo;t into photography like they\u0026rsquo;re into music, they won\u0026rsquo;t talk about their favorite photog like they will their favorite artist, even though most people nowadays take pics daily. Forget things like lenses and f-stops and lenses. Peoples eyes glaze over the moment that comes up. That gap can make being a photographer hard. Having someone you can share your photos with ends up completely opening up the he world of photography.\nGoing out to Shoot  No Trespassing \nSo what now. I wrote a ton of words about liking taking pictures. But anyone can write words on the internet. Some people even make money through writing words on the internet. For the first time in like 5 years, I went out just to shoot. But one shoot doesn\u0026rsquo;t make me a photographer.\nEvery picture in this blog post was shot on my iPhone 11 and edited in Darkroom (except the pics of the iPhone 11, taken on an iPhone 10). And I am setting myself a goal to photograph and post something interesting once a week. I don\u0026rsquo;t know how much I\u0026rsquo;ll be able to because pandemic but it\u0026rsquo;s a start.\n Moving On \nI\u0026rsquo;m also planning on digging up my Yashica Electro 35 film camera and my Olympus Micro 4/3 camera. As much as I love shooting on my phone, having a dedicated camera is a different experience and one I love. I want to develop film and explore aspects of photography I never got to. I never took portraits. I never just walked around an urban area to do pure street photography. I never sat and took a proper landscapes. I have so much room to explore in photography.\nI found that sense of adventure again. And I\u0026rsquo;m going to do my best to never lose it again.\n","date":"2020-09-10T00:00:00Z","permalink":"https://zaza.studio/p/iphone-photography/","title":"Darkroom Diary: iPhone Photography, and Finding Photography Again"},{"content":"It\u0026rsquo;s the end of the 2010s and I really want to reflect on my life. But I feel like I\u0026rsquo;m in a flux part of my life and with so much happening around me, I thought it\u0026rsquo;d be easier to just do games of the decade.\nA bit about me, I am a gamer but a hobbyist one at best. This is my personal list for games that impacted me the most. It is not commentary of the \u0026ldquo;best\u0026rdquo; games, there are games I played that were objectively great that didn\u0026rsquo;t make my list because they didn\u0026rsquo;t have as much of an impact on me.\n Honorable Mentions  Mario Odyssey \nImage Courtesy of IGDB\nThese are all games that I loved, but didn\u0026rsquo;t make my list for some reason. A different me on a different day might have put any of these on the list, but today they fall just short. Here they are in no particular order.\nWolf Among Us – Great story, fantastic game. But it felt short and I want so much more.\nRogue Legacy – This is probably the game I come back to the most. It took the horribly unaproachable roguelike genre and made it fun, easy to digest, quick, and fun.\nMario Odyssey – Very close to being on my list. As much as I loved it, there was just something missing from Odyssey. A central hub world or more post game content would have made this the perfect Mario game.\nCities Skylines – This game perfected the SimCity formula and made it possible to build amazing cities that didn\u0026rsquo;t trend towards \u0026ldquo;New York but different\u0026rdquo;.\nCuphead – This game is HARD. Like, I like hard games, as you\u0026rsquo;ll see. But this game is hard. The aesthetics are amazing and the gameplay is smooth. I love it so much but I need to take this game in doses.\nCivilization V – I love 4X games in general, but I just don\u0026rsquo;t have the hours in my life to dedicate to them. Plus it wouldn\u0026rsquo;t be fair to put Civ V in this list since Civ VI is apparently a better game on every level, but I haven\u0026rsquo;t played Civ VI yet.\nFallout New Vegas – I made myself only choose one Bethesda game, and Skyrim was more up my alley. If I was 10% more of a post apocalyptic person instead of a fantasy person this would be #5 on my list (spoilers I guess). But New Vegas is so huge and such a great game and I have so much love for it.\nOverwatch - I loved Overwatch. I did. It was my favorite multiplayer FPS when it came out. I grew up on CS and TF2 and for a non-Valve game to take that spot was amazing. But over time the game has changed and I enjoy It less. I don\u0026rsquo;t want to give any specific reasons, but Overwatch feels less like a wonderland compared to when it came out, and that\u0026rsquo;s okay. It still fills a roll in my life, just less so.\n 10. iOS Games  Mini Motorways \nImage Courtesy of Peyton Hable\nI couldn\u0026rsquo;t choose just one game to represent iOS, so I gave it a whole category. In the decade, smartphones really became commonplace and with that, a new way to play games. And smartphone games have been divisive to say the least. Mobile games went from creative to piles of microtransactions. Currently, mobile games have a rep for being basic, full of timers, and full of ways to accidentally spend a substantial amount of money on digital gems, but a few games really stood out to me.\nHoledown – It\u0026rsquo;s a very simple concept. An endless Breakout-style game, but digging down instead of going up. But the game is so smooth and such a pleasure to play that I just fell in love with it.\nMini Metro and Mini Motorways - I know Mini Metro is on other consoles but it feels at home on a phone. And the sequel took so much of what made Mini Metro great and just built on it.\niOS ports like Stardew Valley, Evoland, Roller Coaster Tycoon, Runescape, Tropico etc. These are all games that made their mark on the PC, and developers were able to fully take advantage of touch controls and make the games feel as smooth on iOS as they felt on consoles.\nApple Arcade – Recently, Apple launched a subscription service with access to more than 100 games. It would take too long to explain all of them, so here is a shortlist of games to try: Sayonara Wildhearts, Mini Motorways (I like it that much I\u0026rsquo;m mentioning it twice, deal with it), Card of Darkness (made by Pendleton Ward, creator of Adventure Time), Outsiders, What the Golf, Assemble with Care, Exit the Gungeon, Oceanhorn 2, there\u0026rsquo;s too many good games to list.\n 9. Mario Maker 2  Mario Maker 2 \nImage Courtesy of US Gamer\nThis game was everything I wanted in a 2D Mario game. It had a good campaign, it played great, the mechanics were all there. And there were endless levels that did wild things. I didn\u0026rsquo;t get to play much of the original since it was on a Wii U and no one bought the Wii U, and the 3DS version wasn\u0026rsquo;t a full version.\nBut Mario Maker 2 is something else. The creativity coming out of level creators is amazing. Just watching some good MM2 streamers like Poo, Barb, Dode, Spacekat, etc., and you can see how wild a Mario game can get when you apply a bit of creativity, and more skill than I\u0026rsquo;ll ever have.\nThe only reason this isn\u0026rsquo;t higher is because I haven\u0026rsquo;t been able to put enough time into this, and don\u0026rsquo;t have the skill to play the harder levels. I just want to beat a Panga level once in my life.\n 8. Magic Arena  MTGA_Gameplay \nImage Courtesy of Wizards of the Coast\nThe game that brought me back into Magic. I was am obsessed with Magic and it was really a huge loss for me when I drifted away from playing paper Magic. I have no LGS right now and nowhere to play FNM. I tried Magic Online but I can only handle playing DOS games for so long. Magic Arena is something else. It is a truly modern Magic game. It plays fantastically. There are bugs but they\u0026rsquo;re minor, at least compared to MTGO. The economic model mostly makes sense and I don\u0026rsquo;t get the feeling of being drained for all the money I have compared to other online TCGs. The game is super playable casually and provides the competitive experience I need. Overall, the only reason this isn\u0026rsquo;t higher is cause of Oko. This is a near perfect game, and I hope as Magic goes on Wizards keeps giving MTGA more love, and crafts Magic to take advantage of such a stellar client.\n 7. Destiny 2  Destiny 2 \nImage Courtesy of IGDB\nThis is the game I wanted as a kid. I grew up playing Goldeneye as a small kid, and my very first online experience was Star Wars Battlefront. I also got into Runescape and eventually fell into a pit of Free to Play MMOs. And this whole time, I wanted a game that delivered the kind of consistent world, progression, player bases, and exploration that MMOs had, but as an FPS. Planetside 2 existed, but it wasn\u0026rsquo;t great and it was more a Proto-Battle Royale than a true MMO. Then came Destiny, for the PS3 and Xbox. I didn\u0026rsquo;t have those systems. I watched hungrily at Destiny, wanting to play them, almost buying a PS3 just for it.\nThen Destiny 2 was announced for PC. Oh I needed this game. And having played it consistently for over a year, this is everything I wanted. I only wish MMOFPSs were more common, since I feel like there\u0026rsquo;s still so much to explore in this genre. But for me, Destiny 2 (specifically post-Forsaken), was my dream game. And still is. I still play it weekly. Occasionally I binge it hard. This is a game I waited for and dreamed about for over a decade.\nAnd I kind of built a whole relationship with my girlfriend over this game. So maybe that goes into this being on my list, but it\u0026rsquo;s my list and that\u0026rsquo;s my choice.\n 6. Pokemon Sword/Shield  Pokemon 1 \nImage Courtesy of Peyton Hable\nThis game got me back into Magic Pokemon. I played obsessively from Gen 2 through 4, went back and played Gen 1. I knew every Pokemon up through Gen 4, knew type differences, was getting into IVs and EVs. Then life happened. I never got my hands on a Gen 5 game other than a week borrowing my sis', and before I knew it Gen 5, 6, and 7 all passed me by. Holy shit I missed out on almost half the Pokemon games made.\nSo when I got Sword, I was nervous. The snippets I played of Gens 5-7 weren\u0026rsquo;t fantastic. I felt like parts of the game I loved were taken out or simplified. And starting Sword, I felt that too. But then I started seeing Sword for what it is. A game designed for a modern player. I wasn\u0026rsquo;t 12 anymore. I didn\u0026rsquo;t have 4 hours after school to just ride my bike around Victory Road leveling my Pokemon individually. All the things \u0026ldquo;making the game easier\u0026rdquo; were quality of life changes that kept me playing. I could tweak my team at any point. I didn\u0026rsquo;t have to spend hours leveling my team, I instead can spend that time playing the story.\n Pokemon 2 \nImage Courtesy of Peyton Hable\nAnd to balance the Quality of Life changes, they added challenge to so many other parts. The Gyms are so creative, and the Gym leaders are tough. The Wild Area is the Safari Zone perfected. The fact that you can face a level 50 Pokemon coming out of your first town really makes the Pokemon world feel like a world. It was no longer a fully linear game. This feels like a world people and Pokemon live in. And the whole game has not only made me fall in love with Pokemon all over again, and provide me a game I can play while working full-time and feel fully fulfilled, but it also provided a gateway for my partner, who has never played a Pokemon game, to come in and understand the wild complex world of Pokemon and fall in love with it too.\n 5. The Elder Scrolls V: Skyrim  Skyrim \nImage Courtesy of IGDB\nWhat can I say about Skyrim that hasn\u0026rsquo;t already been said before. This game changed Western RPGs. It took a recipe that was introduced in Morrowind, and improved in Oblivion, and perfected it. By perfect I mean this is still a pile of bugs, but a nice one.\nSkyrim succeeded where Oblivion failed I think mostly cause it\u0026rsquo;s pretty. It\u0026rsquo;s hard to convince someone to play a game that looks odd. Skyrim succeeded in creating a game that gamers were immediately attracted to. And once gamers started playing, it opened up an entire world that you could put 300+ hours into it (without Mods) and still not discover everything. It created a world of memes (Arrow Knee lol) and it exposed a lot of gamers who were used to linear games to a truly open world game. You could put 150 hours into the game and not touch the main story. Or you can complete the main story in 20 hours. The game gives you the freedom to completely ignore the main story and fully enjoy everything.\nAnd every Western RPG, along with a few JRPGs (I\u0026rsquo;ll get to that) have been heavily inspired by Skyrim, taken lessons from it, and it\u0026rsquo;s really expanded on the genre. The Witcher Series is definitely one that benefit from Skyrim existing. And Skyrim is a game I come back and play often. I played it around the time it came out. And over the years I\u0026rsquo;ve probably played it a half a dozen times as different saves, doing completely different things, exploring different worlds, and never having a real repeated experience.\nAnd that\u0026rsquo;s before the wild, amazing mod community that exists on PC. You can get mods to improve quality of life like a map that works as a map or better menus, you can get texture mods to make the game way prettier. You can get mods to add new quests, storylines, weapons, enemies, clothing, etc. Yes there\u0026rsquo;s even a mod to do that, get your mind out of the gutter.\nThe only reason Skyrim isn\u0026rsquo;t higher is cause, well, it\u0026rsquo;s a buggy mess. Even with years of patches, tons of unofficial patches, DLC, everything, it is still full of bugs. And Skyrim has that weird way of having endearing bugs. Most other games, bugs are horrible and run the game. In Skyrim, they\u0026rsquo;re still bugs, but they have a kind of fun around them most games don’t. Most people who were heavily on the internet in 2011-2013ish knows those videos where you see a horse climbing a vertical wall on a mountain, or taking one step and dying, or clipping, or having characters be where they never should be. And while it made it fun, it can be tedious when autosave puts you in an impossible place and you\u0026rsquo;re stuck dying cause of some weird bug.\n 4. Virtual Reality  Virtual Reality \nImage Courtesy of Will Smith (not that one)\nAnother category, not so much cause I can\u0026rsquo;t pick a game, but because I haven\u0026rsquo;t had much time to play VR. In this decade, VR came back from the dead, from a curiosity you\u0026rsquo;d find in a Disney World arcade, to something that anyone could have in their homes. The first time I tried VR, it changed my life. I\u0026rsquo;ve only been able to use it a handful of times, but each time has cemented in me how important VR is. But if I had to pick a game.\n Destiny 2 \nImage Courtesy of IGDB\nBeat Saber – Enough has been written about this. Honestly, the best description of \u0026ldquo;Guitar Hero with Lightsabers\u0026rdquo; will never be enough. Watch gameplays, or find anywhere that does VR demos and try it. It\u0026rsquo;s worth it.\n 3. Celeste  Celeste \nImage Courtesy of IGDB\nThis game had everything I loved. Tricky platforming. A lot of skill. Rewarding gameplay. A killer soundtrack. And a story that hit me just the right way. When Celeste came out, I was a bit lost. A lot had happened in my life, and here comes such a perfect game about overcoming obstacles, and finding yourself along the way. I do not want to give away any more of the story, but for a game I maybe put 20 hours into, I think about it constantly. It gave me hope. It inspired me. It challenged me. And as someone who is terrible at completing games, I completed this one multiple times. Just gameplay alone this deserves to be in my top 10, add in the story and it\u0026rsquo;s honestly very close to being my number 1.\n 2. Portal 2  Portal 2 \nImage Courtesy of IGDB\nPortal was the first game that really got me to say \u0026ldquo;wait, you can do that with a game?\u0026rdquo; It was a nearly perfect game, and honestly the reason I got into PC gaming. A few months before Portal 2 was released, Portal 1 was made free and I ended up getting a graphics card for my parents' desktop just to be able to play it. Then Portal 2 came out and I put way to many hours into it. This game took everything that made Portal great, took out and changed the few pain points that existed, and crafted a beautiful story in the universe they already created.\nPortal 2\u0026rsquo;s story was so great. It expanded this \u0026ldquo;Science lab\u0026rdquo; into this massive pseudo-government operation run by essentially a very angry J.K. Simmons, and created a truly human story with very non-human creatures. You felt for GLaDOS. She wasn\u0026rsquo;t just some crazy machine anymore. She was a tragic character. You feel for Wheatley and his quest, you fall in love with the story between J. Jonah Jameson Cave Johnson and GLaDOS. The game\u0026rsquo;s story is told in such an unorthodox way, and at times it feels like you\u0026rsquo;re along for the ride in someone else\u0026rsquo;s story. But even then, Portal doesn\u0026rsquo;t stop delivering magic.\nThe Co-op campaign is completely separate from the main game and could have been its own game. While the storyline is more simple, the way the puzzles are designed to be played by two players without each player being bored is amazing. And this is the best test for Communication in a relationship let me tell you that.\n 1. The Legend of Zelda: Breath of the Wild This game got me back into Magic Pokemon Zelda. Oh my god there\u0026rsquo;s a trend.\n Zelda 1 \nImage Courtesy of me :)\nBreath of the Wild is what happens when you have 20+ years to polish the Legend of Zelda formula, 10 years to polish the Skyrim formula, and combine them absolutely perfectly. BotW might as well be a sequel to Skyrim, it borrows so much from it. You\u0026rsquo;re given a short tutorial, and then essentially faced with an open world with essentially a \u0026ldquo;you can go this way if you want, but I\u0026rsquo;m not the boss of you\u0026rdquo;. If you wanted to leave the starting area and immediately go fight Ganon, you can. If you want to collect every single Korok Seed, you can. If you just wanna sled down the tallest mountain and get sicccc air, you can. The game gives you absolute freedom. The world is the Zelda world. All the monsters you love are there.\nAll the gameplay from the 3D Zeldas' have been refined to where the combat feels great. The game, instead of punishing you from diverting from the main story, rewards you for exploring. The main plot of the game is always there, and you don\u0026rsquo;t lose your way how you would with Skyrim. And the word I keep coming back to, polish, is everywhere. While Skyrim is a Boogeyman of bugs that somehow learned to walk, Zelda is truly a Nintendo game. The seams are always never visible. The game has a reason for almost everything.\n Zelda 1 \nI got this game in a time of my life where I had almost no time for games. And somehow I put hours upon hours into it. The game never felt dull. There was always something to do, somewhere to explore. You\u0026rsquo;d find somewhere on the map that you think the game devs would ignore cause who would go there and there\u0026rsquo;s a physics challenge there. Or there\u0026rsquo;s a powerful enemy. Or a shrine. Or a Korok. Every single corner of this game was lovingly crafted in a way to provide the best gameplay experience I\u0026rsquo;ve ever had. I come back to this game not with guilt or shame that I\u0026rsquo;ve been away or not finished the story, but with joy and excitement to explore. Dungeons I thought were impossible I\u0026rsquo;m coming back to. I\u0026rsquo;m going to areas I wrote off a year ago. This game has so much in it.\nAnd that\u0026rsquo;s without factoring in the DLC. Nintendo has done a fantastic job of creating DLC that expands the game without taking away what makes the game magical. The DLC doesn\u0026rsquo;t feel forced, it doesn\u0026rsquo;t feel like a cash grab. And it doesn\u0026rsquo;t feel like Nintendo is charging extra for the full experience. It is a nice addition to the game that make the game better.\nThe only pause I have for BotW is the lack of Overworld/Dungeon and the slight repetitiveness of shrines. One of my favorite parts of old Zelda games was clearing dungeons and solving puzzles. And this game didn\u0026rsquo;t really have much of that, other than the Divine Beasts. But the game more than made up for it with it\u0026rsquo;s expansive Overworld, easily the best overworld of any Zelda game.\n Zelda 1 \nThis game honestly helped me love games again. At a time I was jaded at games and Triple A games in general, and Breath of the Wild gave me hope that people are still crafting games with love. Breath of the Wild is my game of the decade, and honestly the best game I have ever played.\n Footnote: Before anyone complains about me not talking about [insert game here], this list is all games that I have played. It\u0026rsquo;s not a definitive list and definitely not meant to be \u0026ldquo;the best games ever\u0026rdquo;. Just the games that impacted me.\nHere is a list of games that might have made my list if I played them, but time exists.\nGTA V\nThe Last of Us\nMass Effect (any)\nDark Souls (genre)\nWitcher 3\nOuter Worlds\nSpider-Man PS4\nBioshock Infinite\nRed Dead (either really)\nBaba is You\nLife is Strange\n4X Games - I love the genre but any one game is dedicating my life to it.\nFirewatch\nThat one game you\u0026rsquo;re mad about.\n Emmanuel Medina\nEmmanuel Medina is a musician, gamer, and Magic player from Southern California.\n","date":"2020-01-01T00:00:00Z","permalink":"https://zaza.studio/p/top-10-games-of-2010-2019/","title":"Top Ten Games of the Decade (2010-2019)"},{"content":"Now, I started writing this before Oko was banned but even after the Ban, I feel like I have something to say.\nSo I was a very into Magic a few years ago. I came into the game at the end of the Return to Ravnica block, my first event and one of the first times playing was an event called a \u0026ldquo;Magic Celebration\u0026rdquo; in 2013 where they handed out free decks and packs. And I was hooked. I was a paper player first, quickly grew tired of Mono-Black Devotion Standard hell and moved into Modern, and played Modern essentially twice a week at my LGS for two-ish years. I ended up having a lot of lifechanging events in 2016ish and I couldn\u0026rsquo;t keep playing.\nI tried Magic Online and even built a Pauper deck, but the UI was just atrocious.\nThen came Magic Arena. I got on it while the beta was going, wow a year ago now. And I\u0026rsquo;ve been hopping in and out every few months. My life shaped up recently in a way I could play a lot more Magic, and since rotation had just happened it would be less difficult for me to get back into Standard.\nOko, Bane of Standard  Oko \nThen came Oko. Oh Oko. Wonderful, terrible Oko. How I hate you.\nWell I should say the first boogeyman I faced was Field of the Dead but that was banned quickly, but I\u0026rsquo;ll get back to that.\nDear dear Oko. I guess I should explain what Oko is and why it\u0026rsquo;s a problem first. Oko is a 3 mana Blue Green planeswalker. That\u0026rsquo;s already fairly powerful, creating a permanent that has to be dealt with on turn 3, or turn 2 if you ramp (this is green they\u0026rsquo;re playing). It comes in at 4 loyalty, and has two plus abilities. +2 you create a Food Token (essentially an Artifact that can be sacrificed to gain life). Or +1 and you can turn any artifact or creature into a Vanilla 3/3 Elk. And that\u0026rsquo;s where it gets powerful. On turn 3, or turn 2 if you/your opponent is lucky, you create a threat that has to be dealt with. At the very least, it is a 6 Loyalty Planeswalker that created an artifact, worst case you\u0026rsquo;re dealing with a 3/3 creature and a 5 Loyalty Planeswalker. That already is powerful enough. But Eldraine has a lot of support for Food decks, so getting artifacts to turn into 3/3s is trivial.\nNice! 69% of the #MythicChampionshipVI field registered Oko, Thief of Crowns. Check out our full Standard Metagame breakdown by @karsten_frank here: https://t.co/L6XUR6WoGk\nTune into https://t.co/we35sjOtfe to watch LIVE! pic.twitter.com/BaiAGi9F0y\n\u0026mdash; Magic Esports (@MagicEsports) November 8, 2019  The deck is so powerful, it completely dominated the standard Pro Tour Mythic Championship. About 69% nice of decks in the tournament used Oko. The three most popular deck types were Sultai Food, Simic Food, and Bant Food. All of them essentially the same deck but with slightly different utility cards. And the Magic community is not happy.\nNow, there\u0026rsquo;s a lot of articles and reddit posts (so many reddit posts) talking about how bad Oko is and how terrible it is for diversity and how bad it is as an experience, and how Wizards keeps repeating mistakes. And there\u0026rsquo;s commentary about Oko from the new player perspective, who don\u0026rsquo;t understand why Oko is good and who are frustrated because their first experience of competitive Magic is a field dominated by Oko.\nBut it\u0026rsquo;s frustrating for a returning player for different reasons. Magic boogeymen have kept me from playing Magic, and this is the worst example in a LONG train of mistakes Wizards has made.\nMagic\u0026rsquo;s Former Boogeymen As I mentioned above, in the short time period that I was playing MTG, I encountered my fair share of boogeymen. None of them as oppressive as Oko but perhaps worse because of how long lived they were. The first rotation I went through, Mono-Black Devotion was an oppressive force. Mono-Black Devotion was so powerful that essentially the entire Theros standard, the entire Standard year, it was THE tier 1 deck to play. Three other sets came out and the deck went essentially unchanged. Next standard came the wonderfully terrible Siege Rhino and the Delve mechanic. Siege Rhino is a card so powerful that the moment it came out it started being played in Modern so much a deck reformed around it, and it even got fringe Legacy play. And the Delve mechanic was so powerful that two cards, Treasure Cruise (aka Ancestral Recall 3.0) and Dig Through Time were eventually banned in Modern and Legacy, and restricted in Vintage. For a new card to get not only banned in so many formats but to have TWO cards restricted in Vintage was a HUGE oversight in power level. And the worst part is that Delve, a mechanic that reduces the cost of a card depending on what you have in your graveyard, was printed in the same set that Fetchlands were. Wizards has been printing mistakes for a long time.\n Treasure Cruise \nThe biggest issue back then is that Wizards didn\u0026rsquo;t do Standard bannings. All these problems were just left to exist in Standard, with the expectation that players would discover a way to play around these cards, or that a new set will push the problem cards out. When oppressive cards went unchecked, Wizards eventually shrugged their shoulders and said \u0026ldquo;these cards will rotate eventually.\u0026rdquo; This was obviously a terrible mentality. And thankfully Wizards has turned around and will actually ban in Standard. But we shouldn\u0026rsquo;t be at the point where there\u0026rsquo;s multiple Standard bannings a year.\nWhat\u0026rsquo;s the solution? I don\u0026rsquo;t know. But to a player who is returning, it feels like I\u0026rsquo;m coming back into a game that pushed me out, only to have it push me out again. In late 2013, played maybe 4 or 5 Standard FNMs before I gave up on Standard. As a new player with no collection and no money, I preferred playing garbage modern decks and losing literally every match to facing the same 3 decks, and facing Mono-Black Devotion every week. And when I come back in, I come back in to face only Oko.\nThis whole situation to me shows that Wizards has not learned their lesson and needs to change how they balance Standard. Because this has continued to be an issue. Eldrazi were oppressive during Battle for Zendikar. An Infinite combo as powerful as Splinter Twin just happened to slip past Wizards during Kaladesh. The Field of the Dead combo was banned weeks after it started being played. And now, a month after Eldraine came out, they banned Oko. This does not breed confidence into players. For new players it can be scary because they are learning that their favorite decks and cards can get banned out of nowhere. But for a returning player, it shows me that in the time I was gone Wizards is still repeating their same mistakes, they just change how they deal with the fallout.\nWizards supposedly created Play Design specifically to fight this. They were supposed to catch horribly broken cards like these. However, instead it seems like more broken stuff has come out since Play Design has come to be. It almost makes you wonder, or at least makes me wonder, if Wizards R\u0026amp;D actually puts less effort into balance, relying on Play Design to catch their mistakes. And it\u0026rsquo;s not Play Design that\u0026rsquo;s catching their mistakes. It\u0026rsquo;s Team ChannelFireball. Or Team SCG or It\u0026rsquo;s the Pro players. Their mistakes are caught after the cards were printed, years after the design of the set was finalized.\nI don\u0026rsquo;t have a solution. Wizards recently released an article stating that they\u0026rsquo;re aware there\u0026rsquo;s a problem with the Play Design team. For now Oko is banned and I can play Magic again. I can echo other people and say that this is why there should be an emphasis on having more formats in MTGA, that Brawl should be daily or that Pioneer cards being added to MTGA is a priority because of Standard environments like this one where players get burned out. But my voice will be lost in the larger chatter of Magic. Everyone else is saying other formats need more support. People have been yelling about formats other than Standard getting more love since Standard was called Type 2. So that beating a dead horse. But I will say that Magic is my favorite game of all time. I can confidently say that now, having quit, having gone from playing GPs to nothing and come back, Magic is my favorite game of all time. And I do not want to have to fight Wizards every step of the way due to broken cards getting printed. I love powerful cards as much as the next player. But what brings me back to Magic is the diversity. The feeling like every game is brand new, every game is a challenge. The feeling like there\u0026rsquo;s endless things to learn. That, even when you\u0026rsquo;ve been playing 5 years, you can still learn something new, and someone new can come out of nowhere and have an impact. And all that goes away when every single game is a mirror match, and all the games play out the same. There\u0026rsquo;s room for that. But Magic is not the game for that.\nImage Courtesy of Wizards of the Coast\n Emmanuel Medina\nEmmanuel Medina is a musician and Magic player from Southern California. He\u0026rsquo;s been playing on and off since the Return to Ravnica block and is starting to write Magic content to help players get into the game and help share his love of Magic\n","date":"2019-11-27T00:00:00Z","permalink":"https://zaza.studio/p/state-of-magic-2019/","title":"Oko: A Returning Player's Perspective"},{"content":"I want to love Elder Scrolls: Blades. I do. I really really do.\n--  Title Screen - I wish it lived up to the hype of seeing this page \nI\u0026rsquo;m starting this off by saying that I am a huge fan of the Elder Scrolls series. I have put more hours than I can count into Oblivion and almost as many into Skyrim. Elder Scrolls Online is in my top 5 MMOs. So I wanted, so desperately, for a mobile game to capture the feeling of Elder Scrolls. The massive world, the progression, the sense of exploration, the feeling of almost endless depth (even if that depth is almost irrelevant to the actual game).\nThis game. Does not. Do that.\nOverview Lets start with what the game is. It is a mobile RPG for iOS and Android. You come back from being exiled as a member of the Blades to find your hometown destroyed. There are three game modes, Town, Abyss, and Arena. The gameplay is similar in all of them. It is a 3D First Person RPG, like Skyrim, ESO, and the Elder Scrolls games in the past. You move by tapping the ground to the location you\u0026rsquo;ll be walking towards. If you go into combat, it focuses in on the enemy and you tap and hold to attack, or click icons to use Magic or Ranged attacks. You can collect items in dungeons by tapping them, or talk to people, again, by tapping on them. A huge aspect of the game is rebuilding a city that was destroyed, in true ES fashion by Magic, by collecting in game currency and resources. Before we even get to the story, or the freemium aspects of Blades, or the game modes, I have to talk about the controls.\nControls --  Yes, people turn exactly like that irl \nWhile this game in many points feels like it was built from the ground up to be a mobile game, it feels like it was built by people who have never played a mobile game. The game can be played both vertically and horizontally. Vertically, swiping on the screen will allow you to look around. Tapping on the ground will move your character. Horizontally this still works, but swiping on what feels like the bottom left 1/8th of the screen will allow you to walk like an analog stick, and swiping on the bottom right 1/8th will move the screen like a right analog stick. This isn\u0026rsquo;t bad per se, but it leads to awkwardness. The movement with tapping feels far worse than with the virtual analog stick. When tapping on the ground to move, the game will automatically take control of the camera, sometimes hilariously badly. Walking up stairs, the actual view you have is terrible, looking up about 45 degrees, and when you reach the top of the stairs your view stays in that position. If you click something around a corner, the character will strafe in a very unusual way around the corner. It is something you can get used to, but definitely annoying. It\u0026rsquo;s definitely more of a “get used to” issue, but still feels like an oversight by the game devs.\nHowever, in landscape, the game plays very well. The movement is smooth when using the virtual joysticks. Your character feels like he’s actually moving. The camera moves a tad slow but it feels a lot more natural horizontally than vertically. It kind of gives this game a feeling like the vertical mode/one hand mode was added way later in development, and the devs didn’t quite know what to do with a mobile game. Movement can be a bit awkward but is something you can get used to. What I couldn\u0026rsquo;t get used to was the combat.\nCombat --  Pop the bubble \nCombat is where this game fully stops feeling like an Elder Scrolls game. You tap and hold to charge an attack, and let go to release it. If you release just when the charging circle gets to its ready indicator, you get a critical hit. You also get buttons on the screen for using abilities and Magic. However, it is a far cry from an actual Elder Scrolls game, where you move, run, use abilities, attack, block, and (in Skyrim) using Shouts. Most fights usually end up being “can you tap correctly” and “are you stronger than the enemy” and that’s it. Any depth is lost in the lack of responsiveness.\nStory --  Nothing to see here \nWhen you launch the game, you get a quick instance where your character is introduced. In traditional Elder Scrolls fashion, something happened and you’re starting life from scratch. Unlike riding a cart to your death, or waking up in a prison, you’re heading home because you were a member of the “Blades” a kind of Secret Service in Tamriel that got disbanded.\nYou defeat a few mercenaries and make your way to town. Because Elder Scrolls and there having to be some supernatural disaster, the town is destroyed. Then the actual game starts.\nBesides this, there are quest missions that further your personal story, discovering who you were and with backstory on what happened to the Blades, as well as insight into the town and the magic beneath it.\nTown --  Fix me please \nThe Town is the Main game mode in ES: Blades. You will go on Quests to rescue town members, or to do tasks that those town members need done (Kill Goblins, Collect Resources, etc.), and get gold and resources that will then help you rebuild the Town. There is a lot to do in the town. You are tasked with rebuilding important buildings like the Blacksmith or Alchemist, which will unlock shops and new weapons/items. And, because this is a mobile Freemium game, the first few buildings are fairly cheap to build, and the price goes up fairly quickly from there, requiring way more time and resources to rebuild. There is also a “Jobs” board that has quests on them, including a Daily and Weekly Quest that has better rewards. These jobs will also drop you into a dungeon instance, just like the quests from town members.\nThe actual instances are where I feel the game really falling apart.\nDungeons I have so much to say about the dungeons, but I’ll start with this.\n Doom had better level design.  Okay that’s a low blow. I’ll be nicer.\n*Temple Run has never looked better*  The dungeons are all more or less the same. They are a set of twisting hallways and rectangular rooms. The dungeons are mostly linear, you walk through the dungeon, kill the NPCs, break some breakables(usually pots), find a few chests, get to the end, rinse, repeat. And this is where I feel the game starts falling apart and you see it for what it is, not an Elder Scrolls game, but just another mobile Freemium game. There is no interesting dungeon design. There are no puzzles. There’s no feeling like you’re in a natural environment. Caves don’t feel like caves, hideouts don’t feel like hideouts. It all feels like randomly twisting passages into random rooms. Besides occasional staircases, the map is more or less flat. While you can say this is a consideration for being a mobile game, there’s plenty of unexplored space on how you can make an interesting dungeon fit for mobile games, instead of just boiling down the formula used on main ES games into its most basic elements, then creating a map that doesn’t even approach a game from 1993s in terms of being interesting.\nYou get a certain amount of decent quests a day so even dungeoneering kinda has a limited lifespan. You go through the dungeon, endure clunky combat, and get rewards.\nAbyss Speaking of Dungeons, an actual interesting new feature of ES: Blades is the Abyss. The Abyss is a Rogue-lite game mode where a dungeon is randomly generated and you have to fight your way through it. I was so excited for this game mode because I love rogue-like and rogue-lite games. Rogue Legacy is one of my favorite games, and I’ve put more hours than I’d like to admit into NetHack. This. Isn’t that.\nYou end up going through a randomly snaking passage into 1-2 rooms. Clear out the NPC enemies, and then you make your way through more passageways till you reach a stairway to make your way down to the next level. And repeat. Enemies get harder as you go down, and every 5 levels it saves your progress so when you go in, you can resume from that level.\nI talked about how much I loved rogue likes. However, this game fully falls on its face and this game mode feels as half baked as the rest of the game. The levels of the dungeon are short. Like… painfully short. I understand that it is a mobile game but they’re short for that. {this can change, revise this}[The enemies feel squishy. There is very little challenge when it comes to the actual combat in the Abyss]. There is little to no exploration, since the actual game mode is about as linear as possible. There’s nothing to discover going down the Abyss. And it feels more like a game of attrition than anything else. How long can you last till your health is drained. That’s it. The Abyss is, in my mind, a great idea for an Elder Scrolls game. No matter how big the ES world is, there’s only so many dungeons Bethesda can design, and having an endless randomly generated dungeon is a great idea. But the lack of interesting anything, lack of complexity, and clunky feel has this feeling like the rest of the game.\nAmbiance and Feel Overall, Elder Scrolls: Blades feels like an Elder Scrolls game without any soul. The Town feels like a generic high fantasy village. There’s not much distinct there that makes it feel like it’s anywhere in Tamriel. A lot of the icons just feel lifted from Oblivion or Skyrim. The town itself might have been made to look generic because it is to be decorated by the players, but even then it feels closer to a generic iOS game than something that belongs in an Elder Scrolls game.\nThe skill system is expanive, and in the time I\u0026rsquo;ve played I haven\u0026rsquo;t gotten to go too far down it, but it\u0026rsquo;s definitely one of the more polished parts of the game, and feels like the one part you can really plan out progression related to the non-city aspects in the game.\nThe dungeons look samey. This has always been an issue in the ES games, but at least on main releases there were puzzles or challenges, or different, non-linear designs to hold the dungeons up. These feel about as generic as possible.\nThe music feels like a bad cover band’s version of Skyrim’s music. It fits the tropes of Fantasy music. It is “epic”, feels like its in a minor key to have some somber moments but still “uplifting”. It’s full of strings. But it just feels like generic music.\nThe fact that the game is instanced, while it is definitely necessary for a mobile game, pulls you out of the game itself. And when part of the selling point of every Elder Scrolls game before this was immersion, I feel like this is a big step back.\nLooking Forward It looks like Bethesda is listening though. Between when I started writing this review and right before it went out, I got this push notificaiton.\n--  I thought I had notifications turned off \nThey are actively trying to do things to make it feel less freemium. This is something I would never expect from a company like(and I hate to pick on them cause they make good games) Supercell. They\u0026rsquo;ve also added confirmation screens for spending any large amount of gems(over 11 says their patch notes) and changed percentages on chest drops. This is good news that Bethesda is listening and this game is more than the cash grab it felt like at the beginning.\nThere is also the Arena coming soon. Where ES: Blades players can fight against each other. The Arena may be a very good reason for more competitive players. I\u0026rsquo;m personally not too keen on PvP on mobile, mostly cause the chances I get for mobile games are maybe a few minutes on the toilet at work, But the option is there, and combat between players I would expect to both feel more natural and actually be more engaging than combat with NPCs.\nFinal Thoughts Honestly, if this game was not an Elder Scrolls game, I would have just ignored it in the app store as another freemium game trying to make a quick buck. It has all the trappings of freemium games, multiple game modes that all rely on timers; a limited amount of short, semi-interesting engaging sections(Jobs/Quests) that you need to wait real world time to reappear, a chest system that takes real world time to open, with the option of paying real world money to speed up. The gameplay is just engaging enough to keep playing, and the city building hits all the right spots for me. But even just two weeks after it\u0026rsquo;s released, I find myself reaching for other games on my phone.\nSince this is my first review, I had to figure out how I\u0026rsquo;m gonna rate games. I think an out of Five system works well, especially for iOS games since there\u0026rsquo;s such a range of games, and experience, that anything more granular feels like it\u0026rsquo;d be too specific to be useful.\n Elder Scrolls: Blades - 3/5 Disclaimer: ES: Blades is in Beta/Early Access and a lot is subject to change. I will add a section about Arena below the final score in an edit once it is released\nThe Good  Semi-engaging gameplay Interesting city building aspect Decent graphics It\u0026rsquo;s an Elder Scrolls Game. On your phone Runs very smooth, even on an iPhone 7  The Bad  Clunky Movement when not using Virtual Joysticks Over-reliance on Freemium aspects like timers on chests and buildings, gems, and quest refresh Uninspired music and visuals that would fit basically any fantasy game, none really feeling Elder Scrolls like Weak Combat Difficult to play in short bursts, not enough content for longer gameplay   Review by Emmanuel Medina\n","date":"2019-04-11T00:00:00Z","permalink":"https://zaza.studio/p/ios-review-es-blades/","title":"iOS Game Reviews: Elder Scrolls Blades"},{"content":"I\u0026rsquo;ve been thinking about my 2019 plan for a while. And after the absolute failure that 2018: Year of Less was, but also the kinda semi success of 2017: Year of Completion, and the success of my 2016: Year of Me, I was excited to talk about my new theme. Also New Years Resolutions are dumb.\nPart of the reason I started this blog is to chronicle my yearly themes. I\u0026rsquo;ll probably repost my old themes but no promises.\nI\u0026rsquo;ve been thinking about a more realistic yearly theme for a while. And thinking about what I want to do in my life going forward. And I realized no matter what, I want to be producing something. I want to be making some kind of content. Be it podcasts, videos, watercolors, making pens, or just keeping this blog up. I\u0026rsquo;m happiest when I\u0026rsquo;m making something. It\u0026rsquo;s just a really nice feeling making something appear out of nothing. And so, for 2019, I\u0026rsquo;m focusing on content.\nIn 2018 I\u0026rsquo;ve done a few things sporadically. I made a Youtube review video(might have been late 2017 but I think it was this year), started podcasts/podcast editing, and got a bit back into painting. But it was so disjointed, and I kept just\u0026hellip; doing other things when I had small amounts of time. But making sure I keep myself accountable to this is a big part of the year\u0026rsquo;s Theme.\nFor people who may not know, yearly themes is a topic that kind of came to be, or was at least first brought to my attention, by the Cortex podcast. Myke and Grey have been doing yearly themes for a few years. And the whole idea is that you don\u0026rsquo;t have a set goal, because goals fail. You set a theme to help guide decisions. It just helps guide your ideas and thought process, and keeps the theme an active part of your mind that you can focus on, instead of wishful thinking.\nAnd I need that because it is really easy for me to lose focus. The last few months of my life I\u0026rsquo;ve mostly lost direction and kinda been meandering through work and responsibilities and I needed better focus on my life going forward.\n","date":"2019-01-06T00:00:00Z","permalink":"https://zaza.studio/p/2019-yearly-theme/","title":"2019: Year of Content"},{"content":"It\u0026rsquo;s been an odd month or two for me. For the first time in as long as I can remember, I\u0026rsquo;ve been mostly disconnected from the internet.\nThis wasn\u0026rsquo;t really any kind of planned event. I had recently become more active on the Do By Friday discord, was fairly active with my bands social media, rediscovered Twitter a third time, and was actually enjoying Instagram. Then, shortly before I took my trip to Mexico, my use basically plummited. Mexico certainly helped, I ran out of data shortly after my plane arrived and I had basically nothing but simple texting for a week. But even after that, my usage of almost all social media went down to near zero.\nI\u0026rsquo;ve been thinking about my internet usage for a while. It definitely was something on my mind since I took a trip to Yosemite in April because, turns out, there\u0026rsquo;s almost no cell signals, and I felt fine. I didn\u0026rsquo;t feel like I was missing out in anything, or like I would fall apart if something happened online and I didn\u0026rsquo;t come across it. But the moment I got back into society, I went back on my phone. I got a new laptop, went to WWDC, got involved in multiple online communities, hell met my SO online. But I had this feeling that I needed to get away from it all.\nThis was not made easier by CGP Grey releasing a lot of content relating to his sabbatical from the internet. It framed the internet as a bad thing that is affecting his focus, and it kind of made me uncomfortable how it brought into focus my relationship with the internet. But I was in denial. Grey is dumb, it\u0026rsquo;s not the internet\u0026rsquo;s fault, it\u0026rsquo;s how his brain works, or it\u0026rsquo;s actually x or y, or he remembers the past wrong and was always like this.\n Then, I kinda just disconnected from the internet... and he was right. And I felt like a slightly better person while doing it.  It gave me a good chance to reflect on what the Internet was really doing to me. I don\u0026rsquo;t believe that it is affecting my attention like other do, that comes from elsewhere. But it definitely was affecting my sanity, because right before my disconnect, were the 2018 Midterm Elections. Elections whose news stories I tracked, whose stats I watched, whose follow up I kept such a close eye on to see which races flipped where at what points due to mail in ballots or issues with voting or otherwise.\nAnd I went from that, to a period where I had almost no political news. Almost no news whatsoever actually. I felt free. But the terrible part is that I felt free after I realized and started reconnecting. After I started refollowing tech sites, political sites, started getting back on Reddit and Twitter, I realized how much those sites impacted me. How sad and stressed they truly made me.\nSo I\u0026rsquo;m left with a dilemma. What am I to do. What could I possibly do to take care of myself. The solution I think I landed on is, sadly, \u0026ldquo;more technology.\u0026rdquo; I have picked up a calendar and task manager app(I\u0026rsquo;ll write about those later) to help me focus on what I have to do instead of what I want to or shouldn\u0026rsquo;t do online. I\u0026rsquo;ve started just browsing news sites on my PC but saving interesting articles to Instapaper so I could read the actual articles in a well designed, clutter free location so I can only focus on one thing. I am thinking about something like an Apple Watch so I can segment notifications into things I need to see on the Watch and things I can ignore on the phone. I\u0026rsquo;ve turned off basically every notification on my phone minus calls, texts, and Omnifocus(this included getting rid of email notifications, that 30,000+ red bubble). I\u0026rsquo;m considering an iPad for purely writing and reading web articles.\nI have a lot to think about. I have some travel in Mid-January that will force another short disconnect from the internet. So I\u0026rsquo;m going to see how much that affects me. But I\u0026rsquo;m sure that I\u0026rsquo;ll be back.\nI mean\u0026hellip; I just started a blog that I\u0026rsquo;m actually keeping up kinda sorta just a bit.\nThis isn\u0026rsquo;t the end of my experiment. But I will definitely be something I think about a LOT in the coming year.\nCGP Grey\u0026rsquo;s Disconnect YouTube Video Disconnect Discussion on Cortex\n","date":"2018-12-29T00:00:00Z","permalink":"https://zaza.studio/p/disconnect/","title":"Accidental Disconnect from the Internet"},{"content":"I left Magic about two years ago. It was a slow fade, and once I was done I thought I was out. I thought I quit this Cardboard Crack\nOH NO\nYou don\u0026rsquo;t just leave Magic.\nAnd I\u0026rsquo;m so glad I\u0026rsquo;m back.\nBackstory. I stopped playing Magic about two years ago mostly due to money and time. I couldn\u0026rsquo;t justify the entry fee, or the time commitment every Friday. So I stopped going. I still kept up with some news, but without playing, that slowed down too. I couldn\u0026rsquo;t play Magic Online, because that is a steaming pile of garbage(more on that later) and Magic stopped being a part of my life. And when I finally wanted to get back into it, my LGS shut down.\nI was deep into Magic. Like\u0026hellip; deep in the competitive circle. My LGS was one of the most competitive stores in all SoCal. And with it shutting down, I felt like even if I wanted to start again, I couldn\u0026rsquo;t. Most other LGSs in my area(which were still 30 minute drive from me) were really casual, and none of the people I had become friends with went to them. And the nearest \u0026ldquo;competitive\u0026rdquo; store, where most of the players moved to, was an hours drive away. I did not have a chance to get back into Magic even if I wanted to. A local GP passed and I didn\u0026rsquo;t go. I would go to every major event in SoCal beforehand.\nThen came Magic Arena.\n MTGA_Gameplay \nMagic Arena is a brand new client designed by Wizards of the Coast to play Magic online. Magic Arena is also currently in Open Beta, but I\u0026rsquo;ve been playing since the closed beta. And it has revived in me a love of Magic I thought I lost a while ago. The other online offerings were bad. So I touched no online way to play Magic until Arena. And Arena is something else. I was skeptical at first, because the last attempt was really bad(people are still crying about MTGO v4). But boy was I wrong. The experience is smooth, the gameplay exceptional, it has a very Apple-like sense of Discoverability where features you don\u0026rsquo;t need will be barely hidden, but when you finally need it they\u0026rsquo;ll be out in the open. It is full Magic with all the insane rule complexities of Magic, but with a design and interface that is stellar for both new players and veterans.\nBut all this is just praising the client itself, what I really am here to do is talk about how it helped me rediscover a love I thought I lost. I had tried, in the time I was away from Magic, to fill that void. I played Hearthstone religiously for a few months. But it lacked a depth that Magic had. I tried MTGO, but the economy is a direct mirror of paper MTG for absolutely no reason and the actual program looks like it\u0026rsquo;s written for Windows 95, and has stability to match. But here was a version of Magic that captured everything that made paper Magic so wonderful.\nMagic is a game I will praise until the end of time. It is so well designed, and the R\u0026amp;D Team at Wizards really does their best to make sure it is still relevant. In the 25 years it has been around, the power creep has been so well managed that eternal decks will still play cards printed 20+ years ago, along with cards made today. And you can feel it. Magic is a game you can teach any kid old enough to logic and you can have a casual game with, but is also deep enough to evoke 20+ years of game theory on, and still have emerging thoughts even today. No other game, at least that I\u0026rsquo;ve found, has that. It is a game that massive communities have built around, a game that continues to gain fans. And Arena is the first time a program has captured this.\nIt is still early on. It is a Beta after all. Simple things like friends lists are still being worked on, and actual tournaments seem a ways away. Plus no Mac client yet grumble grumble. But I just wanted to sing praises to the game that got me back into Magic.\nImage Courtesy of Wizards of the Coast\n","date":"2018-12-05T00:00:00Z","permalink":"https://zaza.studio/p/state-of-magic-2018/","title":"Coming Back to Magic"},{"content":"When I was a kid, I had one big fear. Most kids were scared of heights, or the dark, or the monster under the bed. I was scared of being pulled over. I was scared that the cops were going to take away my mom and dad.\nI\u0026rsquo;m a child of immigrants. I wont go into it too much, but I\u0026rsquo;ll just say both my parents are citizens now. They weren\u0026rsquo;t then. I would get bouts of anxiety if my dad took too long to get home. Did they finally pull him over? Did he run into an immigration checkpoint(they were common in California). Is tonight the night I lose my dad? This was a time before cell phones were common, so I was doubly paranoid. But time passes. Those checkpoints became less common, and my parents went through the process to naturalize.\nSo why am I writing about this now. Why am I talking about a childhood fear? Because today, on Thanksgiving day when I\u0026rsquo;m writing this, that fear came back. That fear that started lingering in the back of my mind since November 2016 came back full force. But this time, it\u0026rsquo;s me, and I\u0026rsquo;m scared if I\u0026rsquo;ll ever make it home.\nToday, writing this, on Thanksgiving Day 2018, Donald Trump, in a fit of imbecilic rage, announced that he is authorizing the use of force on the Mexican border, and is considering outright closing it. Also, today on Thanksgiving Day, I am in Mexico, on the other side of the Mexican border, with plane tickets to go back in a few days.\n \"Earlier on Thursday, U.S. President Donald Trump said he had authorized the use of lethal force on the border and warned that the United States could close the whole frontier.\" - Reuters  This is everything I feared. It is the reality of so many people, that our President, someone elected who lost the popular vote could make one decision and ruin so many lives. But worse, it pulls me back to that kid, home from school, worried that his dad won\u0026rsquo;t come home tonight. Or who sees flashing police lights up ahead and wonders if it will be my last day in the US.\nI don\u0026rsquo;t know why I\u0026rsquo;m writing this. I don\u0026rsquo;t have a point. Trump is in office for two more years. If they truly close the border there\u0026rsquo;s other legal ways for American Citizens to enter the country. I would be thrown into a financial hole if that happens, but life would go on.\nBut I needed this off my chest. I needed to vent. To scream. To FUCKING SCREAM. Because today, I saw my life disappear. In one rash string of tweets, on the day where Americans are supposed to be celebrating the hospitality the natives showed what was ostensively a group of immigrants, one statement threw me into a panic attack. One statement made me cry. And I\u0026rsquo;m filled with pure hopelessness, because I know it won\u0026rsquo;t be the last time.\n","date":"2018-11-23T00:00:00Z","permalink":"https://zaza.studio/p/fear/","title":"Back to Living in Fear"},{"content":" This is my 4th blog attempt. I am keeping this piece unedited to show my thought process back in 2018. Note I am no longer on Jekyll or using the Minimal Mistakes theme  I ask myself that all too much. This is the 3rd blog I try(4th if you count tumblr\u0026hellip; I don\u0026rsquo;t) in earnest to start. And it\u0026rsquo;s been up in some capacity since September, without updates, so even before I get it in a decent state I already feel like I failed(I talk more about my view on failure Here). But here I am. Starting fresh with a new blog in a new place.\nI guess I should maybe start with what this blog is and why I\u0026rsquo;m doing it. The blog itself is a Jekyll blog run off Github Pages. The theme is Minimal Mistakes. I switched to that from Massively because I wanted more customization and dark themes.\nI\u0026rsquo;ve previously made blogs using Wordpress, both the actual blog hosting platform and the self hosted service. And every time there was just some reason I couldn\u0026rsquo;t continue. Wordpress.com was just too restrictive and needed you to pay for everything, whereas the self hosted one was 100% my fault cause I hosted it from my own place\u0026hellip; and DNS isn\u0026rsquo;t fun. I\u0026rsquo;ll just leave that there. Both solutions are great, but not for me.\nSo here I am. On a new service in a new place. I\u0026rsquo;ve already run into a new set of challenges. Jekyll is statically generated off of local files, so any changes to the site need to be made from a computer that has these files. And while I can share them all through GitHub, it still severely restricts where I can make changes to my site. Also, Ruby is\u0026hellip; picky. I am actually writing this post from my grandparents' house in Mexico, with no internet connection. I attempt to run the Jekyll build function, but it says I\u0026rsquo;m missing a file that\u0026rsquo;s on the PC, and the self fix tool needs internet access. So I\u0026rsquo;m completely blind to what this post will even look like when done.\nCould not find ffi-1.9.18 in any of the sources This error message will haunt my dreams.\nSo\u0026hellip; I\u0026rsquo;ve talked about what I\u0026rsquo;m doing, and the challenges I\u0026rsquo;ve faced. But why? Why am I putting myself through this? Is it masochism? Is it some weird social experiment? Honestly\u0026hellip; I don\u0026rsquo;t know. I just know I need an outlet. I have an overactive mind. I suffer from what my friend lovingly called creative blue balls. In my day job, in my life, in my band, there\u0026rsquo;s not many outlets for me to let go and publish what\u0026rsquo;s going on in my head. I need a dumping ground that isn\u0026rsquo;t my notes app(shoutout to Bear). I need something public, even if no one will read it, to host my ideas. I need a sort of public journal to come back to.\nI also essentially need a portfolio. I am doing what I can to shape my life and make it so I can make my way into freelancing, and I need a way to show what I\u0026rsquo;m really about. So I guess there\u0026rsquo;s that too.\nStick around I guess. I can guarantee I\u0026rsquo;ll be writing more.\n","date":"2018-11-21T00:00:00Z","permalink":"https://zaza.studio/p/test-blog-part-3/","title":"Test Blog Part 3!"}]